MediaBinding.SetAudioEncoderConfiguration.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <trt:SetAudioEncoderConfiguration>
    <trt:Configuration token="">
     <tt:Name></tt:Name>
     <tt:UseCount>0</tt:UseCount>
     <tt:Encoding>G711</tt:Encoding>
     <tt:Bitrate>0</tt:Bitrate>
     <tt:SampleRate>0</tt:SampleRate>
     <tt:Multicast>
      <tt:Address>
       <tt:Type>IPv4</tt:Type>
       <tt:IPv4Address></tt:IPv4Address>
       <tt:IPv6Address></tt:IPv6Address>
      </tt:Address>
      <tt:Port>0</tt:Port>
      <tt:TTL>0</tt:TTL>
      <tt:AutoStart>false</tt:AutoStart>
     </tt:Multicast>
     <tt:SessionTimeout>PT0S</tt:SessionTimeout>
    </trt:Configuration>
    <trt:ForcePersistence>false</trt:ForcePersistence>
   </trt:SetAudioEncoderConfiguration>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
